export default {
  ak: 'WSRjBTNowZ7155d2LZ0GExVcfPBspvSx', // 百度api
  cityOptions: [
    {
      'value': '北京',
      'label': '北京'
    },
    {
      'value': '天津',
      'label': '天津'
    },
    {
      'value': '上海',
      'label': '上海'
    },
    {
      'value': '重庆',
      'label': '重庆'
    },
    {
      'value': '河北',
      'label': '河北',
      'children': [
        {
          'value': '石家庄',
          'label': '石家庄'
        },
        {
          'value': '唐山',
          'label': '唐山'
        },
        {
          'value': '秦皇岛',
          'label': '秦皇岛'
        },
        {
          'value': '邯郸',
          'label': '邯郸'
        },
        {
          'value': '邢台',
          'label': '邢台'
        },
        {
          'value': '保定',
          'label': '保定'
        },
        {
          'value': '张家口',
          'label': '张家口'
        },
        {
          'value': '承德',
          'label': '承德'
        },
        {
          'value': '沧州',
          'label': '沧州'
        },
        {
          'value': '廊坊',
          'label': '廊坊'
        },
        {
          'value': '衡水',
          'label': '衡水'
        }
      ]
    },
    {
      'value': '山西',
      'label': '山西',
      'children': [
        {
          'value': '太原',
          'label': '太原'
        },
        {
          'value': '大同',
          'label': '大同'
        },
        {
          'value': '阳泉',
          'label': '阳泉'
        },
        {
          'value': '长治',
          'label': '长治'
        },
        {
          'value': '晋城',
          'label': '晋城'
        },
        {
          'value': '朔州',
          'label': '朔州'
        },
        {
          'value': '晋中',
          'label': '晋中'
        },
        {
          'value': '运城',
          'label': '运城'
        },
        {
          'value': '忻州',
          'label': '忻州'
        },
        {
          'value': '临汾',
          'label': '临汾'
        },
        {
          'value': '吕梁',
          'label': '吕梁'
        }
      ]
    },
    {
      'value': '辽宁',
      'label': '辽宁',
      'children': [
        {
          'value': '沈阳',
          'label': '沈阳'
        },
        {
          'value': '大连',
          'label': '大连'
        },
        {
          'value': '鞍山',
          'label': '鞍山'
        },
        {
          'value': '抚顺',
          'label': '抚顺'
        },
        {
          'value': '本溪',
          'label': '本溪'
        },
        {
          'value': '丹东',
          'label': '丹东'
        },
        {
          'value': '锦州',
          'label': '锦州'
        },
        {
          'value': '营口',
          'label': '营口'
        },
        {
          'value': '阜新',
          'label': '阜新'
        },
        {
          'value': '辽阳',
          'label': '辽阳'
        },
        {
          'value': '盘锦',
          'label': '盘锦'
        },
        {
          'value': '铁岭',
          'label': '铁岭'
        },
        {
          'value': '朝阳',
          'label': '朝阳'
        },
        {
          'value': '葫芦岛',
          'label': '葫芦岛'
        }
      ]
    },
    {
      'value': '吉林',
      'label': '吉林',
      'children': [
        {
          'value': '长春',
          'label': '长春'
        },
        {
          'value': '吉林',
          'label': '吉林'
        },
        {
          'value': '四平',
          'label': '四平'
        },
        {
          'value': '辽源',
          'label': '辽源'
        },
        {
          'value': '通化',
          'label': '通化'
        },
        {
          'value': '白山',
          'label': '白山'
        },
        {
          'value': '松原',
          'label': '松原'
        },
        {
          'value': '白城',
          'label': '白城'
        },
        {
          'value': '延边朝鲜族自治州',
          'label': '延边朝鲜族自治州'
        }
      ]
    },
    {
      'value': '黑龙江',
      'label': '黑龙江',
      'children': [
        {
          'value': '哈尔滨',
          'label': '哈尔滨'
        },
        {
          'value': '齐齐哈尔',
          'label': '齐齐哈尔'
        },
        {
          'value': '鹤岗',
          'label': '鹤岗'
        },
        {
          'value': '双鸭山',
          'label': '双鸭山'
        },
        {
          'value': '鸡西',
          'label': '鸡西'
        },
        {
          'value': '大庆',
          'label': '大庆'
        },
        {
          'value': '伊春',
          'label': '伊春'
        },
        {
          'value': '牡丹江',
          'label': '牡丹江'
        },
        {
          'value': '佳木斯',
          'label': '佳木斯'
        },
        {
          'value': '七台河',
          'label': '七台河'
        },
        {
          'value': '黑河',
          'label': '黑河'
        },
        {
          'value': '绥化',
          'label': '绥化'
        },
        {
          'value': '大兴安岭',
          'label': '大兴安岭'
        }
      ]
    },
    {
      'value': '江苏',
      'label': '江苏',
      'children': [
        {
          'value': '南京',
          'label': '南京'
        },
        {
          'value': '苏州',
          'label': '苏州'
        },
        {
          'value': '无锡',
          'label': '无锡'
        },
        {
          'value': '常州',
          'label': '常州'
        },
        {
          'value': '镇江',
          'label': '镇江'
        },
        {
          'value': '南通',
          'label': '南通'
        },
        {
          'value': '泰州',
          'label': '泰州'
        },
        {
          'value': '扬州',
          'label': '扬州'
        },
        {
          'value': '盐城',
          'label': '盐城'
        },
        {
          'value': '连云港',
          'label': '连云港'
        },
        {
          'value': '徐州',
          'label': '徐州'
        },
        {
          'value': '淮安',
          'label': '淮安'
        },
        {
          'value': '宿迁',
          'label': '宿迁'
        }
      ]
    },
    {
      'value': '浙江',
      'label': '浙江',
      'children': [
        {
          'value': '杭州',
          'label': '杭州'
        },
        {
          'value': '宁波',
          'label': '宁波'
        },
        {
          'value': '温州',
          'label': '温州'
        },
        {
          'value': '嘉兴',
          'label': '嘉兴'
        },
        {
          'value': '湖州',
          'label': '湖州'
        },
        {
          'value': '绍兴',
          'label': '绍兴'
        },
        {
          'value': '金华',
          'label': '金华'
        },
        {
          'value': '衢州',
          'label': '衢州'
        },
        {
          'value': '舟山',
          'label': '舟山'
        },
        {
          'value': '台州',
          'label': '台州'
        },
        {
          'value': '丽水',
          'label': '丽水'
        }
      ]
    },
    {
      'value': '安徽',
      'label': '安徽',
      'children': [
        {
          'value': '合肥',
          'label': '合肥'
        },
        {
          'value': '芜湖',
          'label': '芜湖'
        },
        {
          'value': '蚌埠',
          'label': '蚌埠'
        },
        {
          'value': '淮南',
          'label': '淮南'
        },
        {
          'value': '马鞍山',
          'label': '马鞍山'
        },
        {
          'value': '淮北',
          'label': '淮北'
        },
        {
          'value': '铜陵',
          'label': '铜陵'
        },
        {
          'value': '安庆',
          'label': '安庆'
        },
        {
          'value': '黄山',
          'label': '黄山'
        },
        {
          'value': '滁州',
          'label': '滁州'
        },
        {
          'value': '阜阳',
          'label': '阜阳'
        },
        {
          'value': '宿州',
          'label': '宿州'
        },
        {
          'value': '巢湖',
          'label': '巢湖'
        },
        {
          'value': '六安',
          'label': '六安'
        },
        {
          'value': '亳州',
          'label': '亳州'
        },
        {
          'value': '池州',
          'label': '池州'
        },
        {
          'value': '宣城',
          'label': '宣城'
        }
      ]
    },
    {
      'value': '福建',
      'label': '福建',
      'children': [
        {
          'value': '福州',
          'label': '福州'
        },
        {
          'value': '厦门',
          'label': '厦门'
        },
        {
          'value': '莆田',
          'label': '莆田'
        },
        {
          'value': '三明',
          'label': '三明'
        },
        {
          'value': '泉州',
          'label': '泉州'
        },
        {
          'value': '漳州',
          'label': '漳州'
        },
        {
          'value': '南平',
          'label': '南平'
        },
        {
          'value': '龙岩',
          'label': '龙岩'
        },
        {
          'value': '宁德',
          'label': '宁德'
        }
      ]
    },
    {
      'value': '江西',
      'label': '江西',
      'children': [
        {
          'value': '南昌',
          'label': '南昌'
        },
        {
          'value': '景德镇',
          'label': '景德镇'
        },
        {
          'value': '萍乡',
          'label': '萍乡'
        },
        {
          'value': '九江',
          'label': '九江'
        },
        {
          'value': '新余',
          'label': '新余'
        },
        {
          'value': '鹰潭',
          'label': '鹰潭'
        },
        {
          'value': '赣州',
          'label': '赣州'
        },
        {
          'value': '吉安',
          'label': '吉安'
        },
        {
          'value': '宜春',
          'label': '宜春'
        },
        {
          'value': '抚州',
          'label': '抚州'
        },
        {
          'value': '上饶',
          'label': '上饶'
        }
      ]
    },
    {
      'value': '山东',
      'label': '山东',
      'children': [
        {
          'value': '济南',
          'label': '济南'
        },
        {
          'value': '青岛',
          'label': '青岛'
        },
        {
          'value': '淄博',
          'label': '淄博'
        },
        {
          'value': '枣庄',
          'label': '枣庄'
        },
        {
          'value': '东营',
          'label': '东营'
        },
        {
          'value': '烟台',
          'label': '烟台'
        },
        {
          'value': '潍坊',
          'label': '潍坊'
        },
        {
          'value': '济宁',
          'label': '济宁'
        },
        {
          'value': '泰安',
          'label': '泰安'
        },
        {
          'value': '威海',
          'label': '威海'
        },
        {
          'value': '日照',
          'label': '日照'
        },
        {
          'value': '莱芜',
          'label': '莱芜'
        },
        {
          'value': '临沂',
          'label': '临沂'
        },
        {
          'value': '德州',
          'label': '德州'
        },
        {
          'value': '聊城',
          'label': '聊城'
        },
        {
          'value': '滨州',
          'label': '滨州'
        },
        {
          'value': '菏泽',
          'label': '菏泽'
        }
      ]
    },
    {
      'value': '河南',
      'label': '河南',
      'children': [
        {
          'value': '郑州',
          'label': '郑州'
        },
        {
          'value': '开封',
          'label': '开封'
        },
        {
          'value': '洛阳',
          'label': '洛阳'
        },
        {
          'value': '平顶山',
          'label': '平顶山'
        },
        {
          'value': '安阳',
          'label': '安阳'
        },
        {
          'value': '鹤壁',
          'label': '鹤壁'
        },
        {
          'value': '新乡',
          'label': '新乡'
        },
        {
          'value': '焦作',
          'label': '焦作'
        },
        {
          'value': '濮阳',
          'label': '濮阳'
        },
        {
          'value': '许昌',
          'label': '许昌'
        },
        {
          'value': '漯河',
          'label': '漯河'
        },
        {
          'value': '三门峡',
          'label': '三门峡'
        },
        {
          'value': '南阳',
          'label': '南阳'
        },
        {
          'value': '商丘',
          'label': '商丘'
        },
        {
          'value': '信阳',
          'label': '信阳'
        },
        {
          'value': '周口',
          'label': '周口'
        },
        {
          'value': '驻马店',
          'label': '驻马店'
        }
      ]
    },
    {
      'value': '湖北',
      'label': '湖北',
      'children': [
        {
          'value': '武汉',
          'label': '武汉'
        },
        {
          'value': '黄石',
          'label': '黄石'
        },
        {
          'value': '十堰',
          'label': '十堰'
        },
        {
          'value': '荆州',
          'label': '荆州'
        },
        {
          'value': '宜昌',
          'label': '宜昌'
        },
        {
          'value': '襄樊',
          'label': '襄樊'
        },
        {
          'value': '鄂州',
          'label': '鄂州'
        },
        {
          'value': '荆门',
          'label': '荆门'
        },
        {
          'value': '孝感',
          'label': '孝感'
        },
        {
          'value': '黄冈',
          'label': '黄冈'
        },
        {
          'value': '咸宁',
          'label': '咸宁'
        },
        {
          'value': '随州',
          'label': '随州'
        },
        {
          'value': '恩施',
          'label': '恩施'
        }
      ]
    },
    {
      'value': '湖南',
      'label': '湖南',
      'children': [
        {
          'value': '长沙',
          'label': '长沙'
        },
        {
          'value': '株洲',
          'label': '株洲'
        },
        {
          'value': '湘潭',
          'label': '湘潭'
        },
        {
          'value': '衡阳',
          'label': '衡阳'
        },
        {
          'value': '邵阳',
          'label': '邵阳'
        },
        {
          'value': '岳阳',
          'label': '岳阳'
        },
        {
          'value': '常德',
          'label': '常德'
        },
        {
          'value': '张家界',
          'label': '张家界'
        },
        {
          'value': '益阳',
          'label': '益阳'
        },
        {
          'value': '郴州',
          'label': '郴州'
        },
        {
          'value': '永州',
          'label': '永州'
        },
        {
          'value': '怀化',
          'label': '怀化'
        },
        {
          'value': '娄底',
          'label': '娄底'
        },
        {
          'value': '湘西',
          'label': '湘西'
        }
      ]
    },
    {
      'value': '广东',
      'label': '广东',
      'children': [
        {
          'value': '广州',
          'label': '广州'
        },
        {
          'value': '深圳',
          'label': '深圳'
        },
        {
          'value': '珠海',
          'label': '珠海'
        },
        {
          'value': '汕头',
          'label': '汕头'
        },
        {
          'value': '韶关',
          'label': '韶关'
        },
        {
          'value': '佛山',
          'label': '佛山'
        },
        {
          'value': '江门',
          'label': '江门'
        },
        {
          'value': '湛江',
          'label': '湛江'
        },
        {
          'value': '茂名',
          'label': '茂名'
        },
        {
          'value': '肇庆',
          'label': '肇庆'
        },
        {
          'value': '惠州',
          'label': '惠州'
        },
        {
          'value': '梅州',
          'label': '梅州'
        },
        {
          'value': '汕尾',
          'label': '汕尾'
        },
        {
          'value': '河源',
          'label': '河源'
        },
        {
          'value': '阳江',
          'label': '阳江'
        },
        {
          'value': '清远',
          'label': '清远'
        },
        {
          'value': '东莞',
          'label': '东莞'
        },
        {
          'value': '中山',
          'label': '中山'
        },
        {
          'value': '潮州',
          'label': '潮州'
        },
        {
          'value': '揭阳',
          'label': '揭阳'
        },
        {
          'value': '云浮',
          'label': '云浮'
        }
      ]
    },
    {
      'value': '海南',
      'label': '海南',
      'children': [
        {
          'value': '海口',
          'label': '海口'
        },
        {
          'value': '三亚',
          'label': '三亚'
        }
      ]
    },
    {
      'value': '四川',
      'label': '四川',
      'children': [
        {
          'value': '成都',
          'label': '成都'
        },
        {
          'value': '自贡',
          'label': '自贡'
        },
        {
          'value': '攀枝花',
          'label': '攀枝花'
        },
        {
          'value': '泸州',
          'label': '泸州'
        },
        {
          'value': '德阳',
          'label': '德阳'
        },
        {
          'value': '绵阳',
          'label': '绵阳'
        },
        {
          'value': '广元',
          'label': '广元'
        },
        {
          'value': '遂宁',
          'label': '遂宁'
        },
        {
          'value': '内江',
          'label': '内江'
        },
        {
          'value': '乐山',
          'label': '乐山'
        },
        {
          'value': '南充',
          'label': '南充'
        },
        {
          'value': '眉山',
          'label': '眉山'
        },
        {
          'value': '宜宾',
          'label': '宜宾'
        },
        {
          'value': '广安',
          'label': '广安'
        },
        {
          'value': '达州',
          'label': '达州'
        },
        {
          'value': '雅安',
          'label': '雅安'
        },
        {
          'value': '巴中',
          'label': '巴中'
        },
        {
          'value': '资阳',
          'label': '资阳'
        },
        {
          'value': '阿坝',
          'label': '阿坝'
        },
        {
          'value': '甘孜',
          'label': '甘孜'
        },
        {
          'value': '凉山',
          'label': '凉山'
        }
      ]
    },
    {
      'value': '贵州',
      'label': '贵州',
      'children': [
        {
          'value': '贵阳',
          'label': '贵阳'
        },
        {
          'value': '六盘水',
          'label': '六盘水'
        },
        {
          'value': '遵义',
          'label': '遵义'
        },
        {
          'value': '安顺',
          'label': '安顺'
        },
        {
          'value': '铜仁',
          'label': '铜仁'
        },
        {
          'value': '毕节',
          'label': '毕节'
        },
        {
          'value': '黔西南',
          'label': '黔西南'
        },
        {
          'value': '黔东南',
          'label': '黔东南'
        },
        {
          'value': '黔南',
          'label': '黔南'
        }
      ]
    },
    {
      'value': '云南',
      'label': '云南',
      'children': [
        {
          'value': '昆明',
          'label': '昆明'
        },
        {
          'value': '曲靖',
          'label': '曲靖'
        },
        {
          'value': '玉溪',
          'label': '玉溪'
        },
        {
          'value': '保山',
          'label': '保山'
        },
        {
          'value': '昭通',
          'label': '昭通'
        },
        {
          'value': '丽江',
          'label': '丽江'
        },
        {
          'value': '普洱',
          'label': '普洱'
        },
        {
          'value': '临沧',
          'label': '临沧'
        },
        {
          'value': '德宏',
          'label': '德宏'
        },
        {
          'value': '怒江',
          'label': '怒江'
        },
        {
          'value': '迪庆',
          'label': '迪庆'
        },
        {
          'value': '大理',
          'label': '大理'
        },
        {
          'value': '楚雄',
          'label': '楚雄'
        },
        {
          'value': '红河',
          'label': '红河'
        },
        {
          'value': '文山',
          'label': '文山'
        },
        {
          'value': '西双版纳',
          'label': '西双版纳'
        }
      ]
    },
    {
      'value': '陕西',
      'label': '陕西',
      'children': [
        {
          'value': '西安',
          'label': '西安'
        },
        {
          'value': '铜川',
          'label': '铜川'
        },
        {
          'value': '宝鸡',
          'label': '宝鸡'
        },
        {
          'value': '咸阳',
          'label': '咸阳'
        },
        {
          'value': '渭南',
          'label': '渭南'
        },
        {
          'value': '延安',
          'label': '延安'
        },
        {
          'value': '汉中',
          'label': '汉中'
        },
        {
          'value': '榆林',
          'label': '榆林'
        },
        {
          'value': '安康',
          'label': '安康'
        },
        {
          'value': '商洛',
          'label': '商洛'
        }
      ]
    },
    {
      'value': '甘肃',
      'label': '甘肃',
      'children': [
        {
          'value': '兰州',
          'label': '兰州'
        },
        {
          'value': '嘉峪关',
          'label': '嘉峪关'
        },
        {
          'value': '金昌',
          'label': '金昌'
        },
        {
          'value': '白银',
          'label': '白银'
        },
        {
          'value': '天水',
          'label': '天水'
        },
        {
          'value': '武威',
          'label': '武威'
        },
        {
          'value': '酒泉',
          'label': '酒泉'
        },
        {
          'value': '张掖',
          'label': '张掖'
        },
        {
          'value': '庆阳',
          'label': '庆阳'
        },
        {
          'value': '平凉',
          'label': '平凉'
        },
        {
          'value': '定西',
          'label': '定西'
        },
        {
          'value': '陇南',
          'label': '陇南'
        },
        {
          'value': '临夏',
          'label': '临夏'
        },
        {
          'value': '甘南',
          'label': '甘南'
        }
      ]
    },
    {
      'value': '青海',
      'label': '青海',
      'children': [
        {
          'value': '西宁',
          'label': '西宁'
        },
        {
          'value': '海东',
          'label': '海东'
        },
        {
          'value': '海北',
          'label': '海北'
        },
        {
          'value': '海南',
          'label': '海南'
        },
        {
          'value': '黄南',
          'label': '黄南'
        },
        {
          'value': '果洛',
          'label': '果洛'
        },
        {
          'value': '玉树',
          'label': '玉树'
        },
        {
          'value': '海西',
          'label': '海西'
        }
      ]
    },
    {
      'value': '内蒙古',
      'label': '内蒙古',
      'children': [
        {
          'value': '呼和浩特',
          'label': '呼和浩特'
        },
        {
          'value': '包头',
          'label': '包头'
        },
        {
          'value': '乌海',
          'label': '乌海'
        },
        {
          'value': '赤峰',
          'label': '赤峰'
        },
        {
          'value': '通辽',
          'label': '通辽'
        },
        {
          'value': '鄂尔多斯',
          'label': '鄂尔多斯'
        },
        {
          'value': '呼伦贝尔',
          'label': '呼伦贝尔'
        },
        {
          'value': '巴彦淖尔',
          'label': '巴彦淖尔'
        },
        {
          'value': '乌兰察布',
          'label': '乌兰察布'
        },
        {
          'value': '锡林郭勒盟',
          'label': '锡林郭勒盟'
        },
        {
          'value': '兴安盟',
          'label': '兴安盟'
        },
        {
          'value': '阿拉善盟',
          'label': '阿拉善盟'
        }
      ]
    },
    {
      'value': '广西',
      'label': '广西',
      'children': [
        {
          'value': '南宁',
          'label': '南宁'
        },
        {
          'value': '柳州',
          'label': '柳州'
        },
        {
          'value': '桂林',
          'label': '桂林'
        },
        {
          'value': '梧州',
          'label': '梧州'
        },
        {
          'value': '北海',
          'label': '北海'
        },
        {
          'value': '防城港',
          'label': '防城港'
        },
        {
          'value': '钦州',
          'label': '钦州'
        },
        {
          'value': '贵港',
          'label': '贵港'
        },
        {
          'value': '玉林',
          'label': '玉林'
        },
        {
          'value': '百色',
          'label': '百色'
        },
        {
          'value': '贺州',
          'label': '贺州'
        },
        {
          'value': '河池',
          'label': '河池'
        },
        {
          'value': '来宾',
          'label': '来宾'
        },
        {
          'value': '崇左',
          'label': '崇左'
        }
      ]
    },
    {
      'value': '西藏',
      'label': '西藏',
      'children': [
        {
          'value': '拉萨',
          'label': '拉萨'
        },
        {
          'value': '那曲',
          'label': '那曲'
        },
        {
          'value': '昌都',
          'label': '昌都'
        },
        {
          'value': '林芝',
          'label': '林芝'
        },
        {
          'value': '山南',
          'label': '山南'
        },
        {
          'value': '日喀则',
          'label': '日喀则'
        },
        {
          'value': '阿里',
          'label': '阿里'
        }
      ]
    },
    {
      'value': '宁夏',
      'label': '宁夏',
      'children': [
        {
          'value': '银川',
          'label': '银川'
        },
        {
          'value': '石嘴山',
          'label': '石嘴山'
        },
        {
          'value': '吴忠',
          'label': '吴忠'
        },
        {
          'value': '固原',
          'label': '固原'
        },
        {
          'value': '中卫',
          'label': '中卫'
        }
      ]
    },
    {
      'value': '新疆维吾尔自治区',
      'label': '新疆维吾尔自治区',
      'children': [
        {
          'value': '乌鲁木齐',
          'label': '乌鲁木齐'
        },
        {
          'value': '克拉玛依',
          'label': '克拉玛依'
        },
        {
          'value': '吐鲁番',
          'label': '吐鲁番'
        },
        {
          'value': '哈密',
          'label': '哈密'
        },
        {
          'value': '和田',
          'label': '和田'
        },
        {
          'value': '阿克苏',
          'label': '阿克苏'
        },
        {
          'value': '喀什',
          'label': '喀什'
        },
        {
          'value': '克孜勒苏',
          'label': '克孜勒苏'
        },
        {
          'value': '巴音郭楞',
          'label': '巴音郭楞'
        },
        {
          'value': '昌吉',
          'label': '昌吉'
        },
        {
          'value': '博尔塔拉',
          'label': '博尔塔拉'
        },
        {
          'value': '伊犁',
          'label': '伊犁'
        },
        {
          'value': '塔城',
          'label': '塔城'
        },
        {
          'value': '阿勒泰',
          'label': '阿勒泰'
        }
      ]
    },
    {
      'value': '香港',
      'label': '香港',
      'children': [
        {
          'value': '香港岛',
          'label': '香港岛'
        },
        {
          'value': '九龙东',
          'label': '九龙东'
        },
        {
          'value': '九龙西',
          'label': '九龙西'
        },
        {
          'value': '新界东',
          'label': '新界东'
        },
        {
          'value': '新界西',
          'label': '新界西'
        }
      ]
    },
    {
      'value': '澳门',
      'label': '澳门',
      'children': [
        {
          'value': '澳门半岛',
          'label': '澳门半岛'
        },
        {
          'value': '离岛',
          'label': '离岛'
        }
      ]
    },
    {
      'value': '台湾',
      'label': '台湾',
      'children': [
        {
          'value': '台北',
          'label': '台北'
        },
        {
          'value': '高雄',
          'label': '高雄'
        },
        {
          'value': '基隆',
          'label': '基隆'
        },
        {
          'value': '新竹',
          'label': '新竹'
        },
        {
          'value': '台中',
          'label': '台中'
        },
        {
          'value': '嘉义',
          'label': '嘉义'
        },
        {
          'value': '台南市',
          'label': '台南市'
        }
      ]
    }
  ],
  cityCode: [['33', '嘉峪关市'], ['34', '金昌市'], ['35', '白银市'], ['36', '兰州市'], ['37', '酒泉市'], ['38', '大兴安岭地区'], ['39', '黑河市'], ['40', '伊春市'], ['41', '齐齐哈尔市'], ['42', '佳木斯市'], ['43', '鹤岗市'], ['44', '绥化市'], ['45', '双鸭山市'], ['46', '鸡西市'], ['47', '七台河市'], ['48', '哈尔滨市'], ['49', '牡丹江市'], ['50', '大庆市'], ['51', '白城市'], ['52', '松原市'], ['53', '长春市'], ['54', '延边朝鲜族自治州'], ['55', '吉林市'], ['56', '四平市'], ['57', '白山市'], ['58', '沈阳市'], ['59', '阜新市'], ['60', '铁岭市'], ['61', '呼伦贝尔市'], ['62', '兴安盟'], ['63', '锡林郭勒盟'], ['64', '通辽市'], ['65', '海西蒙古族藏族自治州'], ['66', '西宁市'], ['67', '海北藏族自治州'], ['68', '海南藏族自治州'], ['69', '海东地区'], ['70', '黄南藏族自治州'], ['71', '玉树藏族自治州'], ['72', '果洛藏族自治州'], ['73', '甘孜藏族自治州'], ['74', '德阳市'], ['75', '成都市'], ['76', '雅安市'], ['77', '眉山市'], ['78', '自贡市'], ['79', '乐山市'], ['80', '凉山彝族自治州'], ['81', '攀枝花市'], ['82', '和田地区'], ['83', '喀什地区'], ['84', '克孜勒苏柯尔克孜自治州'], ['85', '阿克苏地区'], ['86', '巴音郭楞蒙古自治州'], ['88', '博尔塔拉蒙古自治州'], ['89', '吐鲁番地区'], ['90', '伊犁哈萨克自治州'], ['91', '哈密地区'], ['92', '乌鲁木齐市'], ['93', '昌吉回族自治州'], ['94', '塔城地区'], ['95', '克拉玛依市'], ['96', '阿勒泰地区'], ['97', '山南地区'], ['98', '林芝地区'], ['99', '昌都地区'], ['100', '拉萨市'], ['101', '那曲地区'], ['102', '日喀则地区'], ['103', '阿里地区'], ['104', '昆明市'], ['105', '楚雄彝族自治州'], ['106', '玉溪市'], ['107', '红河哈尼族彝族自治州'], ['108', '普洱市'], ['109', '西双版纳傣族自治州'], ['110', '临沧市'], ['111', '大理白族自治州'], ['112', '保山市'], ['113', '怒江傈僳族自治州'], ['114', '丽江市'], ['115', '迪庆藏族自治州'], ['116', '德宏傣族景颇族自治州'], ['117', '张掖市'], ['118', '武威市'], ['119', '东莞市'], ['120', '东沙群岛'], ['121', '三亚市'], ['122', '鄂州市'], ['123', '乌海市'], ['124', '莱芜市'], ['125', '海口市'], ['126', '蚌埠市'], ['127', '合肥市'], ['128', '阜阳市'], ['129', '芜湖市'], ['130', '安庆市'], ['131', '北京市'], ['132', '重庆市'], ['133', '南平市'], ['134', '泉州市'], ['135', '庆阳市'], ['136', '定西市'], ['137', '韶关市'], ['138', '佛山市'], ['139', '茂名市'], ['140', '珠海市'], ['141', '梅州市'], ['142', '桂林市'], ['143', '河池市'], ['144', '崇左市'], ['145', '钦州市'], ['146', '贵阳市'], ['147', '六盘水市'], ['148', '秦皇岛市'], ['149', '沧州市'], ['150', '石家庄市'], ['151', '邯郸市'], ['152', '新乡市'], ['153', '洛阳市'], ['154', '商丘市'], ['155', '许昌市'], ['156', '襄阳市'], ['157', '荆州市'], ['158', '长沙市'], ['159', '衡阳市'], ['160', '镇江市'], ['161', '南通市'], ['162', '淮安市'], ['163', '南昌市'], ['164', '新余市'], ['165', '通化市'], ['166', '锦州市'], ['167', '大连市'], ['168', '乌兰察布市'], ['169', '巴彦淖尔市'], ['170', '渭南市'], ['171', '宝鸡市'], ['172', '枣庄市'], ['173', '日照市'], ['174', '东营市'], ['175', '威海市'], ['176', '太原市'], ['177', '文山壮族苗族自治州'], ['178', '温州市'], ['179', '杭州市'], ['180', '宁波市'], ['181', '中卫市'], ['182', '临夏回族自治州'], ['183', '辽源市'], ['184', '抚顺市'], ['185', '阿坝藏族羌族自治州'], ['186', '宜宾市'], ['187', '中山市'], ['188', '亳州市'], ['189', '滁州市'], ['190', '宣城市'], ['191', '廊坊市'], ['192', '宁德市'], ['193', '龙岩市'], ['194', '厦门市'], ['195', '莆田市'], ['196', '天水市'], ['197', '清远市'], ['198', '湛江市'], ['199', '阳江市'], ['200', '河源市'], ['201', '潮州市'], ['202', '来宾市'], ['203', '百色市'], ['204', '防城港市'], ['205', '铜仁地区'], ['206', '毕节地区'], ['207', '承德市'], ['208', '衡水市'], ['209', '濮阳市'], ['210', '开封市'], ['211', '焦作市'], ['212', '三门峡市'], ['213', '平顶山市'], ['214', '信阳市'], ['215', '鹤壁市'], ['216', '十堰市'], ['217', '荆门市'], ['218', '武汉市'], ['219', '常德市'], ['220', '岳阳市'], ['221', '娄底市'], ['222', '株洲市'], ['223', '盐城市'], ['224', '苏州市'], ['225', '景德镇市'], ['226', '抚州市'], ['227', '本溪市'], ['228', '盘锦市'], ['229', '包头市'], ['230', '阿拉善盟'], ['231', '榆林市'], ['232', '铜川市'], ['233', '西安市'], ['234', '临沂市'], ['235', '滨州市'], ['236', '青岛市'], ['237', '朔州市'], ['238', '晋中市'], ['239', '巴中市'], ['240', '绵阳市'], ['241', '广安市'], ['242', '资阳市'], ['243', '衢州市'], ['244', '台州市'], ['245', '舟山市'], ['246', '固原市'], ['247', '甘南藏族自治州'], ['248', '内江市'], ['249', '曲靖市'], ['250', '淮南市'], ['251', '巢湖市'], ['252', '黄山市'], ['253', '淮北市'], ['254', '三明市'], ['255', '漳州市'], ['256', '陇南市'], ['257', '广州市'], ['258', '云浮市'], ['259', '揭阳市'], ['260', '贺州市'], ['261', '南宁市'], ['262', '遵义市'], ['263', '安顺市'], ['264', '张家口市'], ['265', '唐山市'], ['266', '邢台市'], ['267', '安阳市'], ['268', '郑州市'], ['269', '驻马店市'], ['270', '宜昌市'], ['271', '黄冈市'], ['272', '益阳市'], ['273', '邵阳市'], ['274', '湘西土家族苗族自治州'], ['275', '郴州市'], ['276', '泰州市'], ['277', '宿迁市'], ['278', '宜春市'], ['279', '鹰潭市'], ['280', '朝阳市'], ['281', '营口市'], ['282', '丹东市'], ['283', '鄂尔多斯市'], ['284', '延安市'], ['285', '商洛市'], ['286', '济宁市'], ['287', '潍坊市'], ['288', '济南市'], ['289', '上海市'], ['290', '晋城市'], ['291', '南充市'], ['292', '丽水市'], ['293', '绍兴市'], ['294', '湖州市'], ['295', '北海市'], ['297', '赤峰市'], ['298', '六安市'], ['299', '池州市'], ['300', '福州市'], ['301', '惠州市'], ['302', '江门市'], ['303', '汕头市'], ['304', '梧州市'], ['305', '柳州市'], ['306', '黔南布依族苗族自治州'], ['307', '保定市'], ['308', '周口市'], ['309', '南阳市'], ['310', '孝感市'], ['311', '黄石市'], ['312', '张家界市'], ['313', '湘潭市'], ['314', '永州市'], ['315', '南京市'], ['316', '徐州市'], ['317', '无锡市'], ['318', '吉安市'], ['319', '葫芦岛市'], ['320', '鞍山市'], ['321', '呼和浩特市'], ['322', '吴忠市'], ['323', '咸阳市'], ['324', '安康市'], ['325', '泰安市'], ['326', '烟台市'], ['327', '吕梁市'], ['328', '运城市'], ['329', '广元市'], ['330', '遂宁市'], ['331', '泸州市'], ['332', '天津市'], ['333', '金华市'], ['334', '嘉兴市'], ['335', '石嘴山市'], ['336', '昭通市'], ['337', '铜陵市'], ['338', '肇庆市'], ['339', '汕尾市'], ['340', '深圳市'], ['341', '贵港市'], ['342', '黔东南苗族侗族自治州'], ['343', '黔西南布依族苗族自治州'], ['344', '漯河市'], ['346', '扬州市'], ['347', '连云港市'], ['348', '常州市'], ['349', '九江市'], ['350', '萍乡市'], ['351', '辽阳市'], ['352', '汉中市'], ['353', '菏泽市'], ['354', '淄博市'], ['355', '大同市'], ['356', '长治市'], ['357', '阳泉市'], ['358', '马鞍山市'], ['359', '平凉市'], ['360', '银川市'], ['361', '玉林市'], ['362', '咸宁市'], ['363', '怀化市'], ['364', '上饶市'], ['365', '赣州市'], ['366', '聊城市'], ['367', '忻州市'], ['368', '临汾市'], ['369', '达州市'], ['370', '宿州市'], ['371', '随州市'], ['372', '德州市'], ['373', '恩施土家族苗族自治州'], ['731', '阿拉尔市'], ['770', '石河子市'], ['789', '五家渠市'], ['792', '图木舒克市'], ['1214', '定安县'], ['1215', '儋州市'], ['1216', '万宁市'], ['1217', '保亭黎族苗族自治县'], ['1218', '西沙群岛'], ['1277', '济源市'], ['1293', '潜江市'], ['1498', '中沙群岛'], ['1515', '南沙群岛'], ['1641', '屯昌县'], ['1642', '昌江黎族自治县'], ['1643', '陵水黎族自治县'], ['1644', '五指山市'], ['1713', '仙桃市'], ['2031', '琼中黎族苗族自治县'], ['2032', '乐东黎族自治县'], ['2033', '临高县'], ['2358', '琼海市'], ['2359', '白沙黎族自治县'], ['2634', '东方市'], ['2654', '天门市'], ['2734', '神农架林区'], ['2757', '澄迈县'], ['2758', '文昌市'], ['2911', '澳门特别行政区'], ['2912', '香港特别行政区'], ['9001', '桃园市'], ['9002', '台北市'], ['9003', '南投县'], ['9004', '嘉义市'], ['9005', '彰化县'], ['9006', '新竹县'], ['9007', '澎湖县'], ['9008', '台东县'], ['9009', '宜兰县'], ['9010', '新北市'], ['9011', '基隆市'], ['9012', '屏东县'], ['9013', '嘉义县'], ['9014', '云林县'], ['9015', '花莲县'], ['9016', '台南市'], ['9017', '台中市'], ['9018', '新竹市'], ['9019', '高雄市'], ['9020', '苗栗县']],
  shopTag: ['全部商品', /* '评价', */ '商家信息'],
  shopStatus: ['营业', '冻结', '休息'],
  applyStatus: ['审核中', '审核通过', '审核不通过'],
  sex: ['女', '男'],
  auth: ['无权限', '有权限'],
  toFormData: obj => {
    let str = ''
    for (const i in obj) {
      const value = typeof obj[i] === 'object' ? JSON.stringify(obj[i]) : obj[i]
      str += `${i}=${value}&`
    }
    return str.slice(0, str.length - 1)
  },
  accDiv: (arg1, arg2) => {
    let t1 = 0
    let t2 = 0
    let r1
    let r2
    try {
      t1 = arg1.toString().split('.')[1].length
    } catch (e) {}
    try {
      t2 = arg2.toString().split('.')[1].length
    } catch (e) {}
    r1 = Number(arg1.toString().replace('.', ''))
    r2 = Number(arg2.toString().replace('.', ''))
    return (r1 / r2) * Math.pow(10, t2 - t1)
  },
  accMul: (arg1, arg2) => {
    let m = 0
    let s1 = arg1.toString()
    let s2 = arg2.toString()
    try {
      m += s1.split('.')[1].length
    } catch (e) {}
    try {
      m += s2.split('.')[1].length
    } catch (e) {}
    return Number(s1.replace('.', '')) * Number(s2.replace('.', '')) / Math.pow(10, m)
  },
  accAdd: (arg1, arg2) => {
    let r1
    let r2
    let m
    try {
      r1 = arg1.toString().split('.')[1].length
    } catch (e) {
      r1 = 0
    }
    try {
      r2 = arg2.toString().split('.')[1].length
    } catch (e) {
      r2 = 0
    }
    m = Math.pow(10, Math.max(r1, r2))
    return (arg1 * m + arg2 * m) / m
  }
}
